product_id_mapping_Trt = {
    'สายบริหาร': {'Costcenter': '1990000', 'Product': '','เงินเดือน/ค่าจ้าง':8211101,'ค่าครองชีพ':8211102,'ตำแหน่ง/วิชา':8211103,'ค่าล่วงเวลา':8211104,'เบี้ยขยัน':8211105,'โบนัส':8211201,'รายได้อื่นๆ':8211114,'ค่าทักษะ':'-','เงินชดเชย':8211202,'กองทุน':8211107,'ประกันสังคม':8211108},
    # indirect----------------------------------
    'G0 : ด้านอุตสาหกรรม': {'Costcenter': '6199000',
     'Product': '','เงินเดือน/ค่าจ้าง':7211101,'ค่าครองชีพ':7211102,'ตำแหน่ง/วิชา':7211103,'ค่าล่วงเวลา':7211104,'เบี้ยขยัน':7211105,'โบนัส':7211201,'รายได้อื่นๆ':7211114,'ค่าทักษะ':7211113,'เงินชดเชย':7211202,'กองทุน':7211107,'ประกันสังคม':7211108},

     'ฝ่ายวิศวกรรมแม่พิมพ์และจิ๊ก': {'Costcenter': '6139900',
     'Product': '','เงินเดือน/ค่าจ้าง':7211101,'ค่าครองชีพ':7211102,'ตำแหน่ง/วิชา':7211103,'ค่าล่วงเวลา':7211104,'เบี้ยขยัน':7211105,'โบนัส':7211201,'รายได้อื่นๆ':7211114,'ค่าทักษะ':7211113,'เงินชดเชย':7211202,'กองทุน':7211107,'ประกันสังคม':7211108},

     'ฝ่ายแม่พิมพ์และจิ๊ก': {'Costcenter': '6119900',
     'Product': '','เงินเดือน/ค่าจ้าง':7211101,'ค่าครองชีพ':7211102,'ตำแหน่ง/วิชา':7211103,'ค่าล่วงเวลา':7211104,'เบี้ยขยัน':7211105,'โบนัส':7211201,'รายได้อื่นๆ':7211114,'ค่าทักษะ':7211113,'เงินชดเชย':7211202,'กองทุน':7211107,'ประกันสังคม':7211108},
    # direct--------------------------------------------
    'ส่วนออกแบบแม่พิมพ์และจิ๊ก': {'Costcenter': '6130199', 'Product': '','เงินเดือน/ค่าจ้าง':6211101,'ค่าครองชีพ':6211102,'ตำแหน่ง/วิชา':6211103,'ค่าล่วงเวลา':6211104,'เบี้ยขยัน':6211105,'โบนัส':6211201,'รายได้อื่นๆ':6211111,'ค่าทักษะ':6211110,'เงินชดเชย':6211202,'กองทุน':6211107,'ประกันสังคม':6211108},

    'ส่วนวิศวกรรมแม่พิมพ์และจิ๊ก': {'Costcenter': '6130299', 'Product': '','เงินเดือน/ค่าจ้าง':6211101,'ค่าครองชีพ':6211102,'ตำแหน่ง/วิชา':6211103,'ค่าล่วงเวลา':6211104,'เบี้ยขยัน':6211105,'โบนัส':6211201,'รายได้อื่นๆ':6211111,'ค่าทักษะ':6211110,'เงินชดเชย':6211202,'กองทุน':6211107,'ประกันสังคม':6211108},

    'ส่วนสร้างและบำรุงรักษาแม่พิมพ์และจิ๊ก': {'Costcenter': '6110299', 'Product': '','เงินเดือน/ค่าจ้าง':6211101,'ค่าครองชีพ':6211102,'ตำแหน่ง/วิชา':6211103,'ค่าล่วงเวลา':6211104,'เบี้ยขยัน':6211105,'โบนัส':6211201,'รายได้อื่นๆ':6211111,'ค่าทักษะ':6211110,'เงินชดเชย':6211202,'กองทุน':6211107,'ประกันสังคม':6211108},

    'หน่วยปรับแต่งแม่พิมพ์ A': {'Costcenter': '6110201', 'Product': '','เงินเดือน/ค่าจ้าง':6211101,'ค่าครองชีพ':6211102,'ตำแหน่ง/วิชา':6211103,'ค่าล่วงเวลา':6211104,'เบี้ยขยัน':6211105,'โบนัส':6211201,'รายได้อื่นๆ':6211111,'ค่าทักษะ':6211110,'เงินชดเชย':6211202,'กองทุน':6211107,'ประกันสังคม':6211108},

    'หน่วยปรับแต่งแม่พิมพ์ B': {'Costcenter': '6110202', 'Product': '','เงินเดือน/ค่าจ้าง':6211101,'ค่าครองชีพ':6211102,'ตำแหน่ง/วิชา':6211103,'ค่าล่วงเวลา':6211104,'เบี้ยขยัน':6211105,'โบนัส':6211201,'รายได้อื่นๆ':6211111,'ค่าทักษะ':6211110,'เงินชดเชย':6211202,'กองทุน':6211107,'ประกันสังคม':6211108},

    'หน่วยสร้างจิ๊กและอุปกรณ์': {'Costcenter': '6110203', 'Product': '','เงินเดือน/ค่าจ้าง':6211101,'ค่าครองชีพ':6211102,'ตำแหน่ง/วิชา':6211103,'ค่าล่วงเวลา':6211104,'เบี้ยขยัน':6211105,'โบนัส':6211201,'รายได้อื่นๆ':6211111,'ค่าทักษะ':6211110,'เงินชดเชย':6211202,'กองทุน':6211107,'ประกันสังคม':6211108},

    'หน่วยเครื่องมือกลใหญ่': {'Costcenter': '6110101', 'Product': '','เงินเดือน/ค่าจ้าง':6211101,'ค่าครองชีพ':6211102,'ตำแหน่ง/วิชา':6211103,'ค่าล่วงเวลา':6211104,'เบี้ยขยัน':6211105,'โบนัส':6211201,'รายได้อื่นๆ':6211111,'ค่าทักษะ':6211110,'เงินชดเชย':6211202,'กองทุน':6211107,'ประกันสังคม':6211108},
    
    'หน่วยเครื่องมือกลเล็ก (07-63)': {'Costcenter': '6110102', 'Product': '','เงินเดือน/ค่าจ้าง':6211101,'ค่าครองชีพ':6211102,'ตำแหน่ง/วิชา':6211103,'ค่าล่วงเวลา':6211104,'เบี้ยขยัน':6211105,'โบนัส':6211201,'รายได้อื่นๆ':6211111,'ค่าทักษะ':6211110,'เงินชดเชย':6211202,'กองทุน':6211107,'ประกันสังคม':6211108},

    }
