product_id_mapping_Tru = {
    'ฝ่ายตรวจสอบภายใน และระบบงานคุณภาพ': {'Costcenter': '2049900', 'Product': '00','เงินเดือน/ค่าจ้าง':8211101,'ค่าครองชีพ':8211102,'ตำแหน่ง/วิชา':8211103,'ค่าล่วงเวลา':8211104,'เบี้ยขยัน':8211105,'โบนัส':8211201,'รายได้อื่นๆ':8211114,'ค่าทักษะ':'-','เงินชดเชย':8211202,'กองทุน':8211107,'ประกันสังคม':8211108},

    'ฝ่ายจัดหา': {'Costcenter': '2029900', 'Product': '00','เงินเดือน/ค่าจ้าง':8211101,'ค่าครองชีพ':8211102,'ตำแหน่ง/วิชา':8211103,'ค่าล่วงเวลา':8211104,'เบี้ยขยัน':8211105,'โบนัส':8211201,'รายได้อื่นๆ':8211114,'ค่าทักษะ':'-','เงินชดเชย':8211202,'กองทุน':8211107,'ประกันสังคม':8211108},

    'ฝ่ายบัญชีและการเงิน': {'Costcenter': '2019900', 'Product': '00','เงินเดือน/ค่าจ้าง':8211101,'ค่าครองชีพ':8211102,'ตำแหน่ง/วิชา':8211103,'ค่าล่วงเวลา':8211104,'เบี้ยขยัน':8211105,'โบนัส':8211201,'รายได้อื่นๆ':8211114,'ค่าทักษะ':'-','เงินชดเชย':8211202,'กองทุน':8211107,'ประกันสังคม':8211108},

    'ฝ่ายเทคโนโลยีสารสนเทศ': {'Costcenter': '2039900', 'Product': '00','เงินเดือน/ค่าจ้าง':8211101,'ค่าครองชีพ':8211102,'ตำแหน่ง/วิชา':8211103,'ค่าล่วงเวลา':8211104,'เบี้ยขยัน':8211105,'โบนัส':8211201,'รายได้อื่นๆ':8211114,'ค่าทักษะ':'-','เงินชดเชย':8211202,'กองทุน':8211107,'ประกันสังคม':8211108},

    'สายงานบริหาร': {'Costcenter': '1990000', 'Product': '00','เงินเดือน/ค่าจ้าง':8211101,'ค่าครองชีพ':8211102,'ตำแหน่ง/วิชา':8211103,'ค่าล่วงเวลา':8211104,'เบี้ยขยัน':8211105,'โบนัส':8211201,'รายได้อื่นๆ':8211114,'ค่าทักษะ':'-','เงินชดเชย':8211202,'กองทุน':8211107,'ประกันสังคม':8211108},

    'ฝ่ายทรัพยากรบุคคล': {'Costcenter':'2059900', 'Product': '00','เงินเดือน/ค่าจ้าง':8211101,'ค่าครองชีพ':8211102,'ตำแหน่ง/วิชา':8211103,'ค่าล่วงเวลา':8211104,'เบี้ยขยัน':8211105,'โบนัส':8211201,'รายได้อื่นๆ':8211114,'ค่าทักษะ':'-','เงินชดเชย':8211202,'กองทุน':8211107,'ประกันสังคม':8211108},

    'ฝ่ายฝึกอบรมและพัฒนาบุคลากร': {'Costcenter': '2079900', 'Product': '00','เงินเดือน/ค่าจ้าง':8211101,'ค่าครองชีพ':8211102,'ตำแหน่ง/วิชา':8211103,'ค่าล่วงเวลา':8211104,'เบี้ยขยัน':8211105,'โบนัส':8211201,'รายได้อื่นๆ':8211114,'ค่าทักษะ':'-','เงินชดเชย':8211202,'กองทุน':8211107,'ประกันสังคม':8211108},

    'สำนักกฎหมายงานราชการและสมาคม': {'Costcenter': '2069900', 'Product': '00','เงินเดือน/ค่าจ้าง':8211101,'ค่าครองชีพ':8211102,'ตำแหน่ง/วิชา':8211103,'ค่าล่วงเวลา':8211104,'เบี้ยขยัน':8211105,'โบนัส':8211201,'รายได้อื่นๆ':8211114,'ค่าทักษะ':'-','เงินชดเชย':8211202,'กองทุน':8211107,'ประกันสังคม':8211108},

    'ด้านขายและการตลาด': {'Costcenter': '3990000', 'Product': '00','เงินเดือน/ค่าจ้าง':8211101,'ค่าครองชีพ':8211102,'ตำแหน่ง/วิชา':8211103,'ค่าล่วงเวลา':8211104,'เบี้ยขยัน':8211105,'โบนัส':8211201,'รายได้อื่นๆ':8211114,'ค่าทักษะ':'-','เงินชดเชย':8211202,'กองทุน':8111107,'ประกันสังคม':8111108},

    'ฝ่ายขาย OEM และขายต่างประเทศ': {'Costcenter': '3029900', 'Product': '00','เงินเดือน/ค่าจ้าง':8211101,'ค่าครองชีพ':8211102,'ตำแหน่ง/วิชา':8211103,'ค่าล่วงเวลา':8211104,'เบี้ยขยัน':8211105,'โบนัส':8211201,'รายได้อื่นๆ':8211114,'ค่าทักษะ':'-','เงินชดเชย':8211202,'กองทุน':8111107,'ประกันสังคม':8111108},

    'ฝ่ายขาย และการตลาด (03-65)': {'Costcenter': '3019900', 'Product': '00','เงินเดือน/ค่าจ้าง':8211101,'ค่าครองชีพ':8211102,'ตำแหน่ง/วิชา':8211103,'ค่าล่วงเวลา':8211104,'เบี้ยขยัน':8211105,'โบนัส':8211201,'รายได้อื่นๆ':8211114,'ค่าทักษะ':'-','เงินชดเชย':8211202,'กองทุน':8111107,'ประกันสังคม':8111108},

    'ฝ่ายพัฒนาธุรกิจ': {'Costcenter': '1029900', 'Product': '00','เงินเดือน/ค่าจ้าง':8211101,'ค่าครองชีพ':8211102,'ตำแหน่ง/วิชา':8211103,'ค่าล่วงเวลา':8211104,'เบี้ยขยัน':8211105,'โบนัส':8211201,'รายได้อื่นๆ':8211114,'ค่าทักษะ':'-','เงินชดเชย':8211202,'กองทุน':8211107,'ประกันสังคม':8211108},

    'ฝ่ายสำนักกรรมการผู้จัดการ': {'Costcenter': '1019900', 'Product': '00','เงินเดือน/ค่าจ้าง':8211101,'ค่าครองชีพ':8211102,'ตำแหน่ง/วิชา':8211103,'ค่าล่วงเวลา':8211104,'เบี้ยขยัน':8211105,'โบนัส':8211201,'รายได้อื่นๆ':8211114,'ค่าทักษะ':'-','เงินชดเชย':8211202,'กองทุน':8211107,'ประกันสังคม':8211108},

    'ที่ปรึกษา': {'Costcenter': '1990000', 'Product': '00','เงินเดือน/ค่าจ้าง':8111101,'ค่าครองชีพ':8211102,'ตำแหน่ง/วิชา':8211103,'ค่าล่วงเวลา':8211104,'เบี้ยขยัน':8211105,'โบนัส':8211201,'รายได้อื่นๆ':8211114,'ค่าทักษะ':'-','เงินชดเชย':8211202,'กองทุน':8211107,'ประกันสังคม':8211108},

    # _________________________________________________ -indirect 7211202
    'Thairung Engineering Center (04-64)': {'Costcenter': '5990000',
     'Product': '00','เงินเดือน/ค่าจ้าง':7211101,'ค่าครองชีพ':7211102,'ตำแหน่ง/วิชา':7211103,'ค่าล่วงเวลา':7211104,'เบี้ยขยัน':7211105,'โบนัส':7211201,'รายได้อื่นๆ':7211114,'ค่าทักษะ':7211113,'เงินชดเชย':7211202,'กองทุน':7211107,'ประกันสังคม':7211108},

    'ฝ่ายวิจัยและพัฒนา': {'Costcenter': '5019900', 'Product': '1171','เงินเดือน/ค่าจ้าง':8211101,'ค่าครองชีพ':8211102,'ตำแหน่ง/วิชา':8211103,'ค่าล่วงเวลา':8211104,'เบี้ยขยัน':8211105,'โบนัส':8211201,'รายได้อื่นๆ':8211114,'ค่าทักษะ':8211113,'เงินชดเชย':8211202,'กองทุน':8211107,'ประกันสังคม':8211108},

    'ฝ่ายวิศวกรรมการประกอบ': {'Costcenter': '5049900', 'Product': '00','เงินเดือน/ค่าจ้าง':7211101,'ค่าครองชีพ':7211102,'ตำแหน่ง/วิชา':7211103,'ค่าล่วงเวลา':7211104,'เบี้ยขยัน':7211105,'โบนัส':7211201,'รายได้อื่นๆ':7211114,'ค่าทักษะ':7211113,'เงินชดเชย':7211202,'กองทุน':7211107,'ประกันสังคม':7211108},

    'ฝ่ายวิศวกรรมผลิตชิ้นส่วน': {'Costcenter': '5039900', 'Product': '00','เงินเดือน/ค่าจ้าง':7211101,'ค่าครองชีพ':7211102,'ตำแหน่ง/วิชา':7211103,'ค่าล่วงเวลา':7211104,'เบี้ยขยัน':7211105,'โบนัส':7211201,'รายได้อื่นๆ':7211114,'ค่าทักษะ':7211113,'เงินชดเชย':7211202,'กองทุน':7211107,'ประกันสังคม':7211108},

    'ด้านการผลิต Manufacturing (04-64)': {'Costcenter': '4990000', 'Product': '00','เงินเดือน/ค่าจ้าง':7211101,'ค่าครองชีพ':7211102,'ตำแหน่ง/วิชา':7211103,'ค่าล่วงเวลา':7211104,'เบี้ยขยัน':7211105,'โบนัส':7211201,'รายได้อื่นๆ':7211114,'ค่าทักษะ':7211113,'เงินชดเชย':7211202,'กองทุน':7211107,'ประกันสังคม':7211108},

    'ฝ่ายประกันคุณภาพ': {'Costcenter': '4029900', 'Product': '00','เงินเดือน/ค่าจ้าง':7211101,'ค่าครองชีพ':7211102,'ตำแหน่ง/วิชา':7211103,'ค่าล่วงเวลา':7211104,'เบี้ยขยัน':7211105,'โบนัส':7211201,'รายได้อื่นๆ':7211114,'ค่าทักษะ':7211113,'เงินชดเชย':7211202,'กองทุน':7211107,'ประกันสังคม':7211108},

    'ฝ่ายวางแผนและควบคุมการผลิต': {'Costcenter': '4019900', 'Product': '00','เงินเดือน/ค่าจ้าง':7211101,'ค่าครองชีพ':7211102,'ตำแหน่ง/วิชา':7211103,'ค่าล่วงเวลา':7211104,'เบี้ยขยัน':7211105,'โบนัส':7211201,'รายได้อื่นๆ':7211114,'ค่าทักษะ':7211113,'เงินชดเชย':7211202,'กองทุน':7211107,'ประกันสังคม':7211108},

    'ฝ่ายการผลิต': {'Costcenter': '8119900', 'Product': '00','เงินเดือน/ค่าจ้าง':7211101,'ค่าครองชีพ':7211102,'ตำแหน่ง/วิชา':7211103,'ค่าล่วงเวลา':7211104,'เบี้ยขยัน':7211105,'โบนัส':7211201,'รายได้อื่นๆ':7211114,'ค่าทักษะ':7211113,'เงินชดเชย':7211202,'กองทุน':7211107,'ประกันสังคม':7211108},

    'ฝ่ายผลิตชิ้นส่วน': {'Costcenter': '7119900', 'Product': '00','เงินเดือน/ค่าจ้าง':7211101,'ค่าครองชีพ':7211102,'ตำแหน่ง/วิชา':7211103,'ค่าล่วงเวลา':7211104,'เบี้ยขยัน':7211105,'โบนัส':7211201,'รายได้อื่นๆ':7211114,'ค่าทักษะ':7211113,'เงินชดเชย':7211202,'กองทุน':7211107,'ประกันสังคม':7211108},

    'ฝ่ายวิศวกรรมโรงงาน': {'Costcenter': '5029900', 'Product': '00','เงินเดือน/ค่าจ้าง':7211101,'ค่าครองชีพ':7211102,'ตำแหน่ง/วิชา':7211103,'ค่าล่วงเวลา':7211104,'เบี้ยขยัน':7211105,'โบนัส':7211201,'รายได้อื่นๆ':7211114,'ค่าทักษะ':7211113,'เงินชดเชย':7211202,'กองทุน':7211107,'ประกันสังคม':7211108},
    # __________________________________________________ direct
    'ส่วนออกแบบรูปลักษณ์': {'Costcenter': '5010299', 'Product':'1141','เงินเดือน/ค่าจ้าง':8211101,'ค่าครองชีพ':8211102,'ตำแหน่ง/วิชา':8211103,'ค่าล่วงเวลา':8211104,'เบี้ยขยัน':8211105,'โบนัส':8211201,'รายได้อื่นๆ':8211114,'ค่าทักษะ':8211110,'เงินชดเชย':8211202,'กองทุน':8211107,'ประกันสังคม':8211108},

    'หน่วยพัฒนาต้นแบบ': {'Costcenter': '5010201', 'Product': '1141','เงินเดือน/ค่าจ้าง':8211101,'ค่าครองชีพ':8211102,'ตำแหน่ง/วิชา':8211103,'ค่าล่วงเวลา':8211104,'เบี้ยขยัน':8211105,'โบนัส':8211201,'รายได้อื่นๆ':8211114,'ค่าทักษะ':8211110,'เงินชดเชย':8211202,'กองทุน':8211107,'ประกันสังคม':8211108},

    'ส่วนวิเคราะห์และออกแบบวิศวกรรม': {'Costcenter': '5010199', 'Product': '1141','เงินเดือน/ค่าจ้าง':8211101,'ค่าครองชีพ':8211102,'ตำแหน่ง/วิชา':8211103,'ค่าล่วงเวลา':8211104,'เบี้ยขยัน':8211105,'โบนัส':8211201,'รายได้อื่นๆ':8211114,'ค่าทักษะ':8211110,'เงินชดเชย':8211202,'กองทุน':8211107,'ประกันสังคม':8211108},

    'หน่วย PQC': {'Costcenter': '4020201', 'Product': '00','เงินเดือน/ค่าจ้าง':6211101,'ค่าครองชีพ':6211102,'ตำแหน่ง/วิชา':6211103,'ค่าล่วงเวลา':6211104,'เบี้ยขยัน':6211105,'โบนัส':6211201,'รายได้อื่นๆ':6211111,'ค่าทักษะ':6211110,'เงินชดเชย':6211202,'กองทุน':6211107,'ประกันสังคม':6211108},

    'หน่วย QC': {'Costcenter': '4020202', 'Product': '00','เงินเดือน/ค่าจ้าง':6211101,'ค่าครองชีพ':6211102,'ตำแหน่ง/วิชา':6211103,'ค่าล่วงเวลา':6211104,'เบี้ยขยัน':6211105,'โบนัส':6211201,'รายได้อื่นๆ':6211111,'ค่าทักษะ':6211110,'เงินชดเชย':6211202,'กองทุน':6211107,'ประกันสังคม':6211108},

    'ส่วนประกันคุณภาพ': {'Costcenter': '4020199', 'Product': '00','เงินเดือน/ค่าจ้าง':6211101,'ค่าครองชีพ':6211102,'ตำแหน่ง/วิชา':6211103,'ค่าล่วงเวลา':6211104,'เบี้ยขยัน':6211105,'โบนัส':6211201,'รายได้อื่นๆ':6211111,'ค่าทักษะ':6211110,'เงินชดเชย':6211202,'กองทุน':6211107,'ประกันสังคม':6211108},

    'หน่วย คลังสินค้า-โรงประกอบ (04-64)': {'Costcenter': '4010206', 'Product': '00','เงินเดือน/ค่าจ้าง':6211101,'ค่าครองชีพ':6211102,'ตำแหน่ง/วิชา':6211103,'ค่าล่วงเวลา':6211104,'เบี้ยขยัน':6211105,'โบนัส':6211201,'รายได้อื่นๆ':6211111,'ค่าทักษะ':6211110,'เงินชดเชย':6211202,'กองทุน':6211107,'ประกันสังคม':6211108},

    'หน่วย คลังสินค้า-โรงผลิตชิ้นส่วน (04-64)': {'Costcenter': '4010207', 'Product': '00','เงินเดือน/ค่าจ้าง':6211101,'ค่าครองชีพ':6211102,'ตำแหน่ง/วิชา':6211103,'ค่าล่วงเวลา':6211104,'เบี้ยขยัน':6211105,'โบนัส':6211201,'รายได้อื่นๆ':6211111,'ค่าทักษะ':6211110,'เงินชดเชย':6211202,'กองทุน':6211107,'ประกันสังคม':6211108},

    'หน่วย Logistic 1 - Machinery (04-64)': {'Costcenter': '4010301', 'Product': '00','เงินเดือน/ค่าจ้าง':6211101,'ค่าครองชีพ':6211102,'ตำแหน่ง/วิชา':6211103,'ค่าล่วงเวลา':6211104,'เบี้ยขยัน':6211105,'โบนัส':6211201,'รายได้อื่นๆ':6211111,'ค่าทักษะ':6211110,'เงินชดเชย':6211202,'กองทุน':6211107,'ประกันสังคม':6211108},

    'หน่วย Logistic 2 - OEM (04-64)': {'Costcenter': '4010302', 'Product': '00','เงินเดือน/ค่าจ้าง':6211101,'ค่าครองชีพ':6211102,'ตำแหน่ง/วิชา':6211103,'ค่าล่วงเวลา':6211104,'เบี้ยขยัน':6211105,'โบนัส':6211201,'รายได้อื่นๆ':6211111,'ค่าทักษะ':6211110,'เงินชดเชย':6211202,'กองทุน':6211107,'ประกันสังคม':6211108},

    'หน่วย M2': {'Costcenter': '8110302', 'Product': '00','เงินเดือน/ค่าจ้าง':6211101,'ค่าครองชีพ':6211102,'ตำแหน่ง/วิชา':6211103,'ค่าล่วงเวลา':6211104,'เบี้ยขยัน':6211105,'โบนัส':6211201,'รายได้อื่นๆ':6211111,'ค่าทักษะ':6211110,'เงินชดเชย':6211202,'กองทุน':6211107,'ประกันสังคม':6211108},

    'หน่วย M3': {'Costcenter': '8110303', 'Product': '00','เงินเดือน/ค่าจ้าง':6211101,'ค่าครองชีพ':6211102,'ตำแหน่ง/วิชา':6211103,'ค่าล่วงเวลา':6211104,'เบี้ยขยัน':6211105,'โบนัส':6211201,'รายได้อื่นๆ':6211111,'ค่าทักษะ':6211110,'เงินชดเชย':6211202,'กองทุน':6211107,'ประกันสังคม':6211108},
    
    'ส่วนสี': {'Costcenter': '8110299', 'Product': '00','เงินเดือน/ค่าจ้าง':6211101,'ค่าครองชีพ':6211102,'ตำแหน่ง/วิชา':6211103,'ค่าล่วงเวลา':6211104,'เบี้ยขยัน':6211105,'โบนัส':6211201,'รายได้อื่นๆ':6211111,'ค่าทักษะ':6211110,'เงินชดเชย':6211202,'กองทุน':6211107,'ประกันสังคม':6211108},
    
    'หน่วย I': {'Costcenter': '8110201', 'Product': '00','เงินเดือน/ค่าจ้าง':6211101,'ค่าครองชีพ':6211102,'ตำแหน่ง/วิชา':6211103,'ค่าล่วงเวลา':6211104,'เบี้ยขยัน':6211105,'โบนัส':6211201,'รายได้อื่นๆ':6211111,'ค่าทักษะ':6211110,'เงินชดเชย':6211202,'กองทุน':6211107,'ประกันสังคม':6211108},

    'หน่วย K2': {'Costcenter': '8110207', 'Product': '00','เงินเดือน/ค่าจ้าง':6211101,'ค่าครองชีพ':6211102,'ตำแหน่ง/วิชา':6211103,'ค่าล่วงเวลา':6211104,'เบี้ยขยัน':6211105,'โบนัส':6211201,'รายได้อื่นๆ':6211111,'ค่าทักษะ':6211110,'เงินชดเชย':6211202,'กองทุน':6211107,'ประกันสังคม':6211108},

    'หน่วย J2': {'Costcenter': '8110205', 'Product': '00','เงินเดือน/ค่าจ้าง':6211101,'ค่าครองชีพ':6211102,'ตำแหน่ง/วิชา':6211103,'ค่าล่วงเวลา':6211104,'เบี้ยขยัน':6211105,'โบนัส':6211201,'รายได้อื่นๆ':6211111,'ค่าทักษะ':6211110,'เงินชดเชย':6211202,'กองทุน':6211107,'ประกันสังคม':6211108},

    'หน่วย V2 (07-63)': {'Costcenter': '8110208', 'Product': '00','เงินเดือน/ค่าจ้าง':6211101,'ค่าครองชีพ':6211102,'ตำแหน่ง/วิชา':6211103,'ค่าล่วงเวลา':6211104,'เบี้ยขยัน':6211105,'โบนัส':6211201,'รายได้อื่นๆ':6211111,'ค่าทักษะ':6211110,'เงินชดเชย':6211202,'กองทุน':6211107,'ประกันสังคม':6211108},

    'หน่วย J1 (07-63)': {'Costcenter': '8110203', 'Product': '00','เงินเดือน/ค่าจ้าง':6211101,'ค่าครองชีพ':6211102,'ตำแหน่ง/วิชา':6211103,'ค่าล่วงเวลา':6211104,'เบี้ยขยัน':6211105,'โบนัส':6211201,'รายได้อื่นๆ':6211111,'ค่าทักษะ':6211110,'เงินชดเชย':6211202,'กองทุน':6211107,'ประกันสังคม':6211108},

    'หน่วย ติดตั้งอุปกรณ์': {'Costcenter': '8110103', 'Product': '00','เงินเดือน/ค่าจ้าง':6211101,'ค่าครองชีพ':6211102,'ตำแหน่ง/วิชา':6211103,'ค่าล่วงเวลา':6211104,'เบี้ยขยัน':6211105,'โบนัส':6211201,'รายได้อื่นๆ':6211111,'ค่าทักษะ':6211110,'เงินชดเชย':6211202,'กองทุน':6211107,'ประกันสังคม':6211108},

    'หน่วย SM': {'Costcenter': '8110101', 'Product': '00','เงินเดือน/ค่าจ้าง':6211101,'ค่าครองชีพ':6211102,'ตำแหน่ง/วิชา':6211103,'ค่าล่วงเวลา':6211104,'เบี้ยขยัน':6211105,'โบนัส':6211201,'รายได้อื่นๆ':6211111,'ค่าทักษะ':6211110,'เงินชดเชย':6211202,'กองทุน':6211107,'ประกันสังคม':6211108},

    'หน่วย บี1': {'Costcenter': '7110101', 'Product': '00','เงินเดือน/ค่าจ้าง':6211101,'ค่าครองชีพ':6211102,'ตำแหน่ง/วิชา':6211103,'ค่าล่วงเวลา':6211104,'เบี้ยขยัน':6211105,'โบนัส':6211201,'รายได้อื่นๆ':6211111,'ค่าทักษะ':6211110,'เงินชดเชย':6211202,'กองทุน':6211107,'ประกันสังคม':6211108},

    'หน่วย ซี4': {'Costcenter': '7110103', 'Product': '00','เงินเดือน/ค่าจ้าง':6211101,'ค่าครองชีพ':6211102,'ตำแหน่ง/วิชา':6211103,'ค่าล่วงเวลา':6211104,'เบี้ยขยัน':6211105,'โบนัส':6211201,'รายได้อื่นๆ':6211111,'ค่าทักษะ':6211110,'เงินชดเชย':6211202,'กองทุน':6211107,'ประกันสังคม':6211108},

    'หน่วย เอฟ': {'Costcenter': '7110102', 'Product': '00','เงินเดือน/ค่าจ้าง':6211101,'ค่าครองชีพ':6211102,'ตำแหน่ง/วิชา':6211103,'ค่าล่วงเวลา':6211104,'เบี้ยขยัน':6211105,'โบนัส':6211201,'รายได้อื่นๆ':6211111,'ค่าทักษะ':6211110,'เงินชดเชย':6211202,'กองทุน':6211107,'ประกันสังคม':6211108},
    
    'ส่วนผลิตชิ้นส่วน 2': {'Costcenter': '7110399', 'Product': '00','เงินเดือน/ค่าจ้าง':6211101,'ค่าครองชีพ':6211102,'ตำแหน่ง/วิชา':6211103,'ค่าล่วงเวลา':6211104,'เบี้ยขยัน':6211105,'โบนัส':6211201,'รายได้อื่นๆ':6211111,'ค่าทักษะ':6211110,'เงินชดเชย':6211202,'กองทุน':6211107,'ประกันสังคม':6211108},

    'หน่วย บี2': {'Costcenter': '7110301', 'Product': '00','เงินเดือน/ค่าจ้าง':6211101,'ค่าครองชีพ':6211102,'ตำแหน่ง/วิชา':6211103,'ค่าล่วงเวลา':6211104,'เบี้ยขยัน':6211105,'โบนัส':6211201,'รายได้อื่นๆ':6211111,'ค่าทักษะ':6211110,'เงินชดเชย':6211202,'กองทุน':6211107,'ประกันสังคม':6211108},

    # Add more mappings as needed
}