product_id_mapping_Tuc ={
    'สายบริหาร': {'Costcenter': '1990000', 'Product': '','เงินเดือน/ค่าจ้าง':8211101,'ค่าครองชีพ':8211102,'ตำแหน่ง/วิชา':8211103,'ค่าล่วงเวลา':8211104,'เบี้ยขยัน':8211105,'โบนัส':8211201,'รายได้อื่นๆ':8211114,'ค่าทักษะ':'-','เงินชดเชย':8211202,'กองทุน':8211107,'ประกันสังคม':8211108},

    'ฝ่ายขายและการตลาด': {'Costcenter': '3019900', 'Product': '','เงินเดือน/ค่าจ้าง':8211101,'ค่าครองชีพ':8211102,'ตำแหน่ง/วิชา':8211103,'ค่าล่วงเวลา':8211104,'เบี้ยขยัน':8211105,'โบนัส':8211201,'รายได้อื่นๆ':8211114,'ค่าทักษะ':'-','เงินชดเชย':8211202,'กองทุน':8211107,'ประกันสังคม':8211108},

    'ส่วนงานขาย': {'Costcenter': '3010199', 'Product': '','เงินเดือน/ค่าจ้าง':8211101,'ค่าครองชีพ':8211102,'ตำแหน่ง/วิชา':8211103,'ค่าล่วงเวลา':8211104,'เบี้ยขยัน':8211105,'โบนัส':8211201,'รายได้อื่นๆ':8211114,'ค่าทักษะ':'-','เงินชดเชย':8211202,'กองทุน':8211107,'ประกันสังคม':8211108},

    'ส่วนงานขาย': {'Costcenter': '3010199', 'Product': '','เงินเดือน/ค่าจ้าง':8211101,'ค่าครองชีพ':8211102,'ตำแหน่ง/วิชา':8211103,'ค่าล่วงเวลา':8211104,'เบี้ยขยัน':8211105,'โบนัส':8211201,'รายได้อื่นๆ':8211114,'ค่าทักษะ':'-','เงินชดเชย':8211202,'กองทุน':8211107,'ประกันสังคม':8211108},

    'ส่วนงานบริการหลังการขายและอะไหล่': {'Costcenter': '3010599', 'Product': '','เงินเดือน/ค่าจ้าง':8211101,'ค่าครองชีพ':8211102,'ตำแหน่ง/วิชา':8211103,'ค่าล่วงเวลา':8211104,'เบี้ยขยัน':8211105,'โบนัส':8211201,'รายได้อื่นๆ':8211114,'ค่าทักษะ':'-','เงินชดเชย':8211202,'กองทุน':8211107,'ประกันสังคม':8211108},

    'ฝ่ายธุรการงานขนส่ง': {'Costcenter': '2050403', 'Product': '','เงินเดือน/ค่าจ้าง':8211101,'ค่าครองชีพ':8211102,'ตำแหน่ง/วิชา':8211103,'ค่าล่วงเวลา':8211104,'เบี้ยขยัน':8211105,'โบนัส':8211201,'รายได้อื่นๆ':8211114,'ค่าทักษะ':'-','เงินชดเชย':8211202,'กองทุน':8211107,'ประกันสังคม':8211108},

    # Direct--------------------

    'ฝ่ายการผลิต': {'Costcenter': '8119900', 'Product': '','เงินเดือน/ค่าจ้าง':6211101,'ค่าครองชีพ':6211102,'ตำแหน่ง/วิชา':6211103,'ค่าล่วงเวลา':6211104,'เบี้ยขยัน':6211105,'โบนัส':6211201,'รายได้อื่นๆ':6211111,'ค่าทักษะ':6211110,'เงินชดเชย':6211202,'กองทุน':6211107,'ประกันสังคม':6211108},
}